; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph7 - mode
	infrared0 - mode
	spectrograph8 - mode
	image3 - mode
	infrared1 - mode
	spectrograph5 - mode
	thermograph9 - mode
	infrared2 - mode
	thermograph6 - mode
	infrared4 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph8)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph9)
	(supports instrument0 image3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph6)
	(supports instrument1 thermograph9)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph9)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument3 thermograph9)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 Planet5)
	(have_image Planet5 spectrograph8)
	(have_image Planet5 infrared2)
	(have_image Planet5 thermograph9)
	(have_image Star6 image3)
	(have_image Star7 infrared1)
	(have_image Star7 spectrograph7)
	(have_image Planet8 infrared2)
	(have_image Planet8 infrared4)
	(have_image Planet9 spectrograph5)
	(have_image Planet9 infrared4)
	(have_image Planet9 infrared2)
))

)

; plan
1. (turn_to satellite1 star4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star4)
   goals met: 0 of 13
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn_to satellite1 planet9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet9)
   goals met: 0 of 13
5. (take_image satellite1 planet9 instrument2 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 1 of 13
6. (turn_to satellite1 planet8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet8)
   goals met: 1 of 13
7. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 1 of 13
8. (take_image satellite1 planet8 instrument2 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 2 of 13
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 13
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 13
11. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 2 of 13
12. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 13
13. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   goals met: 2 of 13
14. (take_image satellite0 planet5 instrument0 spectrograph8)
   added: (have_image planet5 spectrograph8)
   goals met: 3 of 13
15. (take_image satellite0 planet5 instrument0 thermograph9)
   added: (have_image planet5 thermograph9)
   goals met: 4 of 13
16. (turn_to satellite0 star6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star6)
   goals met: 4 of 13
17. (take_image satellite0 star6 instrument0 image3)
   added: (have_image star6 image3)
   goals met: 5 of 13
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 13
19. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 13
20. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   goals met: 5 of 13
21. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 5 of 13
22. (turn_to satellite0 planet5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet5)
   goals met: 5 of 13
23. (take_image satellite0 planet5 instrument1 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 6 of 13
24. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 6 of 13
25. (take_image satellite0 planet9 instrument1 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 7 of 13
26. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 7 of 13
27. (take_image satellite0 star7 instrument1 infrared1)
   added: (have_image star7 infrared1)
   goals met: 8 of 13
28. (take_image satellite0 star7 instrument1 spectrograph7)
   added: (have_image star7 spectrograph7)
   goals met: 9 of 13
29. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 10 of 13
30. (take_image satellite0 planet8 instrument1 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 11 of 13
31. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 12 of 13
32. (turn_to satellite2 planet9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet9)
   goals met: 12 of 13
33. (take_image satellite2 planet9 instrument4 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 13 of 13
